#+title: group work 02-04
#+author: Ethan Coe-Renner


1. EV: 1 * 1/6*5/6 + 1 * 1/6*5/6 + 2 * 1/6*1/6 = 12/36 = 1/3

   SD: $\sqrt{\frac{5}{6}^2(0-\frac{1}{3})^2 + 2\frac{1}{6}\frac{5}{6}(1-\frac{1}{3})^2) + \frac{1}{6}^2(2-\frac{1}{3})^2} = 0.53$
   
2. 
   
    #+begin_src R :results output :exports both
      values=c(1,0)
      probs=c(1/6,5/6)

      propWins=replicate(1000,sum(sample(values,2,probs,replace=TRUE)))

      print(sum(propWins>0) / 1000)

      print(sd(propWins))

    #+end_src

    #+RESULTS:
    : [1] 0.326
    : [1] 0.5548079

    very close to the answers to (1)

3. 
    #+begin_src R :results output :exports both
      values=c(1,0)
      probs=c(1/6,5/6)

      propWins=replicate(1000,sum(sample(values,6,probs,replace=TRUE)))
      print(mean(propWins))

      print(sd(propWins))
    #+end_src

    #+RESULTS:
    : [1] 1.023
    : [1] 0.9248385

    both the mean and sd increased when the number of dice increased
